In [28]:
"""1. Zaimportuj moduł pandas i numpy, nadaj im standardowe aliasy. Do zmiennej professions wczytaj
zawartość pliku Prestige.csv. Wyświetl nagłówek obiektu data frame"""

import pandas as pd
import numpy as np
professions = pd.read_csv('/Users/kamilw/Desktop/Moje/PythonLearing/Pandas_Udemy/course-files/Prestige.csv')
professions.head()

                  name  education  income  women  prestige  census  type
0   gov.administrators      13.11   12351  11.16      68.8    1113  prof
1     general.managers      12.26   25879   4.02      69.1    1130  prof
2          accountants      12.77    9271  15.70      63.4    1171  prof
3  purchasing.officers      11.42    8865   9.11      56.8    1175  prof
4             chemists      14.62    8403  11.68      73.5    2111  prof

In [29]:
"""2. Zdefiniuj słownik w zmiennej dict, który ma klucze takie, jak nazwy kolumn w professions. Wpisz do
wartości dla klucza name - data scientist, pozostałe wartości zdefiniuj jako NaN. Wyświetl obiekt w celu
werryfikacji."""

dict = {'name':'data scientist','education':np.NaN,'income':np.NaN,'women':np.NaN,'prestige':np.NaN,'census':np.NaN,'type':np.NaN}
dict

{'name': 'data scientist',
 'education': nan,
 'income': nan,
 'women': nan,
 'prestige': nan,
 'census': nan,
 'type': nan}

In [30]:
"""3. Dodaj do profession nowy wiersz zdefiniowany przez słownik dict. W celu weryfikacji wyświetl 5 ostatnich
wartości z profession"""

professions.append(dict, ignore_index=True).tail(5)

               name  education  income  women  prestige  census type
98     taxi.drivers       7.93  4224.0   3.59      25.1  9173.0   bc
99     longshoremen       8.37  4753.0   0.00      26.1  9313.0   bc
100     typesetters      10.00  6462.0  13.58      42.2  9511.0   bc
101     bookbinders       8.55  3617.0  70.87      35.2  9517.0   bc
102  data scientist        NaN     NaN    NaN       NaN     NaN  NaN

In [31]:
"""4. Odszukaj w profession wiersza, w którym name to taxi.drivers. Zapisz go do zmiennej taxi i wyświetl."""

taxi = professions[professions["name"] == 'taxi.drivers']
taxi

            name  education  income  women  prestige  census type
98  taxi.drivers       7.93    4224   3.59      25.1    9173   bc

In [32]:
"""5. Usuń z profession wiersz z indekstem 98 (to właśnie taxi.drivers). Wyświetl 5 ostatnich wartości z
profession"""

professions.drop(98,inplace=True)
professions.tail(10)

                       name  education  income  women  prestige  census  type
91                   masons       6.60    5959   0.52      36.2    8782    bc
92           house.painters       7.81    4549   2.46      29.9    8785    bc
93                 plumbers       8.33    6928   0.61      42.9    8791    bc
94   construction.labourers       7.52    3910   1.09      26.5    8798    bc
95                   pilots      12.27   14032   0.58      66.1    9111  prof
96          train.engineers       8.49    8845   0.00      48.9    9131    bc
97              bus.drivers       7.58    5562   9.47      35.9    9171    bc
99             longshoremen       8.37    4753   0.00      26.1    9313    bc
100             typesetters      10.00    6462  13.58      42.2    9511    bc
101             bookbinders       8.55    3617  70.87      35.2    9517    bc

In [33]:
"""6. Dodaj wiersz znajdujący się w taxi do profession, w taki sposób, aby wiersz na stałe znajdował sie w
zmiennej profession. Wyświetl ostatnich 5 wierszy profession w celu weryfikacji"""

professions = professions.append(taxi)
professions.tail()

             name  education  income  women  prestige  census type
97    bus.drivers       7.58    5562   9.47      35.9    9171   bc
99   longshoremen       8.37    4753   0.00      26.1    9313   bc
100   typesetters      10.00    6462  13.58      42.2    9511   bc
101   bookbinders       8.55    3617  70.87      35.2    9517   bc
98   taxi.drivers       7.93    4224   3.59      25.1    9173   bc

In [34]:
"""7. Usuń z profession kolumnę census"""

del professions['census']
professions.tail()

             name  education  income  women  prestige type
97    bus.drivers       7.58    5562   9.47      35.9   bc
99   longshoremen       8.37    4753   0.00      26.1   bc
100   typesetters      10.00    6462  13.58      42.2   bc
101   bookbinders       8.55    3617  70.87      35.2   bc
98   taxi.drivers       7.93    4224   3.59      25.1   bc

In [35]:
"""8.  Usuń z profession kolumnę type. Wykorzystaj do tego inną metodę niż wykorzystana w poprzednim
zadaniu"""

professions.drop(columns='type', inplace=True)
professions.tail()

             name  education  income  women  prestige
97    bus.drivers       7.58    5562   9.47      35.9
99   longshoremen       8.37    4753   0.00      26.1
100   typesetters      10.00    6462  13.58      42.2
101   bookbinders       8.55    3617  70.87      35.2
98   taxi.drivers       7.93    4224   3.59      25.1